nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/cmsis_driver_examples/lpspi/int_b2b_transfer/master/pin_mux.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW70ACxxx
package_id: MCXW70ACMFT
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: '1', pin_signal: PTB3/LPSPI1_SOUT/LPUART1_RX/TPM3_CLKIN/PWM0_X0, label: FLASH_SOUT, identifier: FLASH_SOUT}
- {pin_num: '47', pin_signal: ADC0_A10/PTB1/LPSPI1_SIN/TPM0_CH4, label: FLASH_SIN, identifier: FLASH_SIN}
- {pin_num: '48', pin_signal: ADC0_A11/PTB2/LPSPI1_SCK/LPUART1_TX/TPM0_CH5, label: FLASH_SCK, identifier: FLASH_SCK}
- {pin_num: '46', pin_signal: ADC0_A9/PTB0/LPSPI1_PCS0/TPM0_CH3, label: FLASH_CS, identifier: FLASH_CS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART_1, signal: RX, pin_signal: PTC2/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM4_CH1, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '40', peripheral: LPUART_1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM0_CLKIN, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t port_c2_pin39_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_RX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(PORT_C, 2U, &port_c2_pin39_config);

    const port_pin_config_t port_c3_pin40_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPUART1_TX */
                                                    .mux = (uint16_t)kPORT_MuxAlt3,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinConfig(PORT_C, 3U, &port_c3_pin40_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPSPI1_InitPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: '46', peripheral: LPSPI_1, signal: PCS0, pin_signal: ADC0_A9/PTB0/LPSPI1_PCS0/TPM0_CH3, direction: INPUT, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '47', peripheral: LPSPI_1, signal: IN, pin_signal: ADC0_A10/PTB1/LPSPI1_SIN/TPM0_CH4, direction: INPUT, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '1', peripheral: LPSPI_1, signal: OUT, pin_signal: PTB3/LPSPI1_SOUT/LPUART1_RX/TPM3_CLKIN/PWM0_X0, direction: INPUT, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '48', peripheral: LPSPI_1, signal: SCK, pin_signal: ADC0_A11/PTB2/LPSPI1_SCK/LPUART1_TX/TPM0_CH5, direction: INPUT, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

