nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/cmsis_driver_examples/lpspi/int_b2b_transfer/master/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI1_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI1_InitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t port_b0_pin46_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPSPI1_PCS0 */
                                                    .mux = (uint16_t)kPORT_MuxAlt2,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinConfig(PORT_B, 0U, &port_b0_pin46_config);

    const port_pin_config_t port_b1_pin47_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPSPI1_SIN */
                                                    .mux = (uint16_t)kPORT_MuxAlt2,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(PORT_B, 1U, &port_b1_pin47_config);

    const port_pin_config_t port_b2_pin48_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPSPI1_SCK */
                                                    .mux = (uint16_t)kPORT_MuxAlt2,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(PORT_B, 2U, &port_b2_pin48_config);

    const port_pin_config_t port_b3_pin1_config = {/* Internal pull-up/down resistor is disabled */
                                                   .pullSelect = (uint16_t)kPORT_PullDisable,
                                                   /* Low internal pull resistor value is selected. */
                                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                   /* Fast slew rate is configured */
                                                   .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                   /* Passive input filter is disabled */
                                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                   /* Open drain output is disabled */
                                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                   /* Low drive strength is configured */
                                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                   /* Pin is configured as LPSPI1_SOUT */
                                                   .mux = (uint16_t)kPORT_MuxAlt2,
                                                   /* Digital input is not inverted */
                                                   .invertInput = (uint16_t)kPORT_InputNormal,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(PORT_B, 3U, &port_b3_pin1_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPSPI1_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '46', peripheral: GPIO_B, signal: 'GPIO, 0', pin_signal: ADC0_A9/PTB0/LPSPI1_PCS0/TPM0_CH3, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '47', peripheral: GPIO_B, signal: 'GPIO, 1', pin_signal: ADC0_A10/PTB1/LPSPI1_SIN/TPM0_CH4, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '1', peripheral: GPIO_B, signal: 'GPIO, 3', pin_signal: PTB3/LPSPI1_SOUT/LPUART1_RX/TPM3_CLKIN/PWM0_X0, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '48', peripheral: GPIO_B, signal: 'GPIO, 2', pin_signal: ADC0_A11/PTB2/LPSPI1_SCK/LPUART1_TX/TPM0_CH5, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

