nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/cmsis_driver_examples/lpspi/int_b2b_transfer/master/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI1_DeinitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPSPI1_DeinitPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up/down resistor is disabled */
                                        .pullSelect = (uint16_t)kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        .slewRate = (uint16_t)kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                        /* Pin is configured as PTB0 */
                                        .mux = (uint16_t)kPORT_MuxAsGpio,
                                        /* Digital input is not inverted */
                                        .invertInput = (uint16_t)kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B0 (pin 46) is configured as PTB0 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_FLASH_CS_PORT, LPSPI1_DEINITPINS_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_SIN = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Pin is configured as PTB1 */
                                         .mux = (uint16_t)kPORT_MuxAsGpio,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B1 (pin 47) is configured as PTB1 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_FLASH_SIN_PORT, LPSPI1_DEINITPINS_FLASH_SIN_PIN, &FLASH_SIN);

    const port_pin_config_t FLASH_SCK = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Pin is configured as PTB2 */
                                         .mux = (uint16_t)kPORT_MuxAsGpio,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B2 (pin 48) is configured as PTB2 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_FLASH_SCK_PORT, LPSPI1_DEINITPINS_FLASH_SCK_PIN, &FLASH_SCK);

    const port_pin_config_t FLASH_SOUT = {/* Internal pull-up/down resistor is disabled */
                                          .pullSelect = (uint16_t)kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          .slewRate = (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                          /* Pin is configured as PTB3 */
                                          .mux = (uint16_t)kPORT_MuxAsGpio,
                                          /* Digital input is not inverted */
                                          .invertInput = (uint16_t)kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_B3 (pin 1) is configured as PTB3 */
    PORT_SetPinConfig(LPSPI1_DEINITPINS_FLASH_SOUT_PORT, LPSPI1_DEINITPINS_FLASH_SOUT_PIN, &FLASH_SOUT);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
